src/Catalogs/Серверы/Серверы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Серверы</name>
  <attributes>
    <name>ТипСервера</name>
    <type>
      <types>EnumRef.ТипыСерверов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСУБД</name>
    <type>
      <types>EnumRef.ТипыСУБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыСерверов/ТипыСерверов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСерверов</name>
  <enumValues>
    <name>Кластер1С</name>
  </enumValues>
  <enumValues>
    <name>СУБД</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Серверы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ТипСервера) Тогда
		ВызватьИсключение НСтр("ru = 'Тип сервера должн быть заполнен.'");
	КонецЕсли;
	
	ТекстСообщенияПорт = НСтр("ru = 'Порт должен быть в диапазоне 1-65535.'");
	Если НЕ Серверы.ПроверитьПорт(Порт) Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПорт, ЭтотОбъект, "Объект.ПортСервера",, Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоКластер1С = (ТипСервера = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Перечисление.ТипыСерверов.Кластер1С"));
	
	Если ЭтоКластер1С Тогда
		МассивНепроверяемыхРеквизитов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ТипСУБД");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры
